In [1]:
import numpy as np
import pandas as pd

In [2]:
movies_df = pd.read_csv('movies.csv')

In [3]:
movies_df.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
movies_df['year'] = movies_df.title.str.extract('(\(\d\d\d\d\))',expand=False)
movies_df['year']

0        (1995)
1        (1995)
2        (1995)
3        (1995)
4        (1995)
          ...
62418    (2018)
62419    (2001)
62420    (2018)
62421    (2001)
62422    (1962)
Name: year, Length: 62423, dtype: object

In [5]:
#Removing paranthesis
movies_df['year'] = movies_df.year.str.extract('(\d\d\d\d)',expand=False)
movies_df['year']

0        1995
1        1995
2        1995
3        1995
4        1995
         ...
62418    2018
62419    2001
62420    2018
62421    2001
62422    1962
Name: year, Length: 62423, dtype: object

In [6]:
movies_df['title']

0                          Toy Story (1995)
1                            Jumanji (1995)
2                   Grumpier Old Men (1995)
3                  Waiting to Exhale (1995)
4        Father of the Bride Part II (1995)
                        ...
62418                             We (2018)
62419             Window of the Soul (2001)
62420                      Bad Poems (2018)
62421                   A Girl Thing (2001)
62422        Women of Devil's Island (1962)
Name: title, Length: 62423, dtype: object

In [7]:
#Removing the years from the 'title' column
movies_df['title'] = movies_df.title.str.replace('(\(\d\d\d\d\))', '')
movies_df['title']

C:\Users\Gowri M\AppData\Local\Temp\ipykernel_3088\2532954281.py:2: FutureWarning: The default value of regex will change from True to False in a future version.
  movies_df['title'] = movies_df.title.str.replace('(\(\d\d\d\d\))', '')

0                          Toy Story
1                            Jumanji
2                   Grumpier Old Men
3                  Waiting to Exhale
4        Father of the Bride Part II
                     ...
62418                             We
62419             Window of the Soul
62420                      Bad Poems
62421                   A Girl Thing
62422        Women of Devil's Island
Name: title, Length: 62423, dtype: object

In [8]:
#Applying the strip function to get rid of any ending whitespace characters that may have appeared
movies_df['title'] = movies_df['title'].apply(lambda x: x.strip())

In [9]:
movies_df.head()

,movieId,title,genres,year
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men,Comedy|Romance,1995
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II,Comedy,1995

In [10]:
movies_df = movies_df.drop('genres', 1)
movies_df.head()

C:\Users\Gowri M\AppData\Local\Temp\ipykernel_3088\1727178456.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  movies_df = movies_df.drop('genres', 1)

   movieId                        title  year
0        1                    Toy Story  1995
1        2                      Jumanji  1995
2        3             Grumpier Old Men  1995
3        4            Waiting to Exhale  1995
4        5  Father of the Bride Part II  1995

In [11]:
ratings_df = pd.read_csv('ratings.csv')

In [12]:
ratings_df.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [13]:
ratings_df = ratings_df.drop('timestamp', 1)
ratings_df.head()

C:\Users\Gowri M\AppData\Local\Temp\ipykernel_3088\3809009477.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  ratings_df = ratings_df.drop('timestamp', 1)

   userId  movieId  rating
0       1      296     5.0
1       1      306     3.5
2       1      307     5.0
3       1      665     5.0
4       1      899     3.5

In [14]:
inputList = [
            {'title':'The Conjuring 2', 'rating':5},
            {'title':'Girl in Woods', 'rating':3.5},
            {'title':'From A to B', 'rating':2},
            {'title':"The Three Musketeers", 'rating':5},
            {'title':'Jumanji', 'rating':4.5}
         ] 
moviesIp = pd.DataFrame(inputList)
moviesIp

                  title  rating
0       The Conjuring 2     5.0
1         Girl in Woods     3.5
2           From A to B     2.0
3  The Three Musketeers     5.0
4               Jumanji     4.5

In [15]:
#Filtering out the movies by title
inputId = movies_df[movies_df['title'].isin(moviesIp['title'].tolist())]

#Then merging it so we can get the movieId. It's implicitly merging it by title.
moviesIp = pd.merge(inputId, moviesIp)

#Dropping information we won't use from the input dataframe
moviesIp = moviesIp.drop('year', 1)

moviesIp

C:\Users\Gowri M\AppData\Local\Temp\ipykernel_3088\4210341623.py:8: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only.
  moviesIp = moviesIp.drop('year', 1)

   movieId                 title  rating
0        2               Jumanji     4.5
1   150106  The Three Musketeers     5.0
2   160908  The Three Musketeers     5.0
3   159858       The Conjuring 2     5.0
4   160141         Girl in Woods     3.5
5   160688           From A to B     2.0

In [16]:
#Filtering out users that have watched movies that the input has watched and storing it
userSubset = ratings_df[ratings_df['movieId'].isin(moviesIp['movieId'].tolist())]
userSubset.head()

      userId  movieId  rating
1459       9        2     5.0
1715      12        2     2.0
3203      19        2     3.5
3661      20        2     2.5
5051      35        2     3.0

In [17]:
userSubsetGroup = userSubset.groupby(['userId'])

In [18]:
userSubsetGroup.get_group(12)

      userId  movieId  rating
1715      12        2     2.0

In [19]:
len(userSubsetGroup.get_group(12))

1

In [20]:
userSubsetGroup.get_group(580)

       userId  movieId  rating
75567     580        2     5.0

In [21]:

len(userSubsetGroup.get_group(580))

1

In [22]:

userSubsetGroup = sorted(userSubsetGroup,  key=lambda x: len(x[1]), reverse=True)

In [23]:

userSubsetGroup[0]

(50335,
          userId  movieId  rating
 7751555   50335        2     2.0
 7753157   50335   159858     0.5
 7753167   50335   160141     0.5)

In [24]:
#name of top user group
userSubsetGroup[0][0]

50335

In [25]:
#dataframe of top user group
userSubsetGroup[0][1]

         userId  movieId  rating
7751555   50335        2     2.0
7753157   50335   159858     0.5
7753167   50335   160141     0.5

In [26]:
userSubsetGroup = userSubsetGroup[0:100]

In [27]:
correlationDict = {}

for name, group in userSubsetGroup:
    
    group = group.sort_values(by='movieId')
    moviesIp = moviesIp.sort_values(by='movieId')
    
    nRatings = len(group)
    
    temp_df = moviesIp[moviesIp['movieId'].isin(group['movieId'].tolist())]
    RatingList = temp_df['rating'].tolist()
    
    GroupList = group['rating'].tolist()
    
    Sxx = sum([i**2 for i in RatingList]) - pow(sum(RatingList),2)/float(nRatings)
    Syy = sum([i**2 for i in GroupList]) - pow(sum(GroupList),2)/float(nRatings)
    Sxy = sum( i*j for i, j in zip(RatingList, GroupList)) - sum(RatingList)*sum(GroupList)/float(nRatings)
    
    if Sxx != 0 and Syy != 0:
        correlationDict[name] = Sxy/np.sqrt(Sxx*Syy)
    else:
        correlationDict[name] = 0

In [28]:
correlationDict.items()

dict_items([(50335, 0.1889822365046138), (101613, 0.6286185570937193), (321, 1.0), (494, 0), (541, -1.0), (1101, 1.0), (1503, -1.0), (1920, -1.0), (2345, -1.0), (2389, 1.0), (2669, 0), (3150, -1.0), (3394, 1.0), (4019, 1.0), (4310, -1.0), (4689, -1.0), (4973, -1.0), (5018, 0), (5114, -1.0), (5694, 0), (6115, -1.0), (6276, 0), (6467, 1.0), (6497, 1.0), (6553, -1.0), (6826, -1.0), (8476, -1.0), (8802, 0), (9849, -1.0), (11052, 0), (11056, 1.0), (11279, 1.0), (11491, -1.0), (12552, 0), (12567, -1.0), (13134, 1.0), (13254, -1.0), (14400, 0), (14458, -1.0), (14573, 1.0), (14686, 0), (14965, -1.0), (15281, 0), (15560, 1.0), (16265, 0), (16879, 1.0), (17474, -1.0), (17669, 1.0), (18023, 1.0), (18683, 1.0), (18740, -1.0), (18959, 0), (19247, 0), (19442, 0), (19886, -1.0), (20302, -1.0), (20330, 1.0), (20744, -1.0), (20917, 0), (21737, -1.0), (21918, 1.0), (21923, 1.0), (22023, 1.0), (22175, -1.0), (22253, 1.0), (22349, 0), (22459, 1.0), (22522, 1.0), (22980, -1.0), (23535, 1.0), (23632, -1.0), (23763, -1.0), (23886, 0), (24161, -1.0), (24303, 1.0), (24730, 0), (24906, 0), (25158, -1.0), (25182, 1.0), (25513, 1.0), (25627, 0), (25847, 1.0), (26024, -1.0), (26672, -1.0), (26676, -1.0), (26983, 1.0), (27171, 0), (27197, 1.0), (27305, 1.0), (27554, -1.0), (28399, 0), (28999, 0), (29065, 1.0), (29104, 1.0), (29542, -1.0), (29631, -1.0), (29799, 1.0), (29981, 1.0), (29999, 1.0), (30621, 1.0)])

In [29]:
pearson = pd.DataFrame.from_dict(correlationDict, orient='index')
pearson.head()

               0
50335   0.188982
101613  0.628619
321     1.000000
494     0.000000
541    -1.000000

In [30]:
pearson.columns = ['similarityIndex']
pearson['userId'] = pearson.index
pearson.index = range(len(pearson))
pearson.head()

   similarityIndex  userId
0         0.188982   50335
1         0.628619  101613
2         1.000000     321
3         0.000000     494
4        -1.000000     541

In [31]:
topUsers=pearson.sort_values(by='similarityIndex', ascending=False)[0:50]
topUsers.head()

    similarityIndex  userId
99              1.0   30621
39              1.0   14573
66              1.0   22459
22              1.0    6467
23              1.0    6497

In [32]:
topUsersRating = topUsers.merge(ratings_df, left_on='userId', right_on='userId', how='inner')
topUsersRating.head()

   similarityIndex  userId  movieId  rating
0              1.0   30621        2     3.0
1              1.0   30621       39     3.5
2              1.0   30621       47     5.0
3              1.0   30621       48     2.0
4              1.0   30621       50     3.0

In [33]:
topUsersRating['weightedRating'] = topUsersRating['similarityIndex']*topUsersRating['rating']
topUsersRating.head()

   similarityIndex  userId  movieId  rating  weightedRating
0              1.0   30621        2     3.0             3.0
1              1.0   30621       39     3.5             3.5
2              1.0   30621       47     5.0             5.0
3              1.0   30621       48     2.0             2.0
4              1.0   30621       50     3.0             3.0

In [34]:
tempTopUsersRating = topUsersRating.groupby('movieId').sum()[['similarityIndex','weightedRating']]
tempTopUsersRating.columns = ['sum_similarityIndex','sum_weightedRating']
tempTopUsersRating.head()

         sum_similarityIndex  sum_weightedRating
movieId
1                  31.817601          121.270403
2                  37.817601          102.078129
3                   7.000000           14.500000
4                   1.000000            3.000000
5                   7.000000           16.000000

In [35]:
recommendation = pd.DataFrame()

recommendation['weighted average recommendation score'] = tempTopUsersRating['sum_weightedRating']/tempTopUsersRating['sum_similarityIndex']
recommendation['movieId'] = tempTopUsersRating.index
recommendation.head()

         weighted average recommendation score  movieId
movieId
1                                     3.811425        1
2                                     2.699223        2
3                                     2.071429        3
4                                     3.000000        4
5                                     2.285714        5

In [36]:
recommendation = recommendation.sort_values(by='weighted average recommendation score', ascending=False)
recommendation.head()

         weighted average recommendation score  movieId
movieId
8256                                       5.0     8256
183197                                     5.0   183197
5304                                       5.0     5304
99764                                      5.0    99764
26587                                      5.0    26587

In [37]:
movies_df.loc[movies_df['movieId'].isin(recommendation.head(20)['movieId'].tolist())]

       movieId                                              title  year
510        515                            Remains of the Day, The  1993
1119      1147                                 When We Were Kings  1996
1616      1678                                 Joy Luck Club, The  1993
1621      1683                             Wings of the Dove, The  1997
5095      5202                               Mon oncle d'Amérique  1980
5196      5304  Rome, Open City (a.k.a. Open City) (Roma, citt...  1945
7001      7126                   Killing of a Chinese Bookie, The  1976
7005      7130                                            Darling  1965
7695      8256                                    Queen Christina  1933
7905      8618                                      Johnny Guitar  1954
8893     26587                           Decalogue, The (Dekalog)  1989
8942     26699                          Close-Up (Nema-ye Nazdik)  1990
8959     26729        Hearts of Darkness: A Filmmakers Apocalypse  1991
12028    56786                    W.R.: Mysteries of the Organism  1971
12059    57183             Like Stars on Earth (Taare Zameen Par)  2007
14558    76866                           Until the Light Takes Us  2008
19161    99764                          It's Such a Beautiful Day  2012
19263   100185                                            Starlet  2012
31676   139195                       Jim Henson's The Storyteller  1989
51457   183197                         Dave Chappelle: Equanimity  2017